# config.py
# ----------------------------------------------------
# ไฟล์เก็บค่าคงที่และการตั้งค่าของ Simulation
# ----------------------------------------------------

# --- 1. ค่าคงที่เวลา (นาที) ---
T_PREP = 2      # นาทีในการเตรียมของ (ใช้ คน)
T_COOK = 5      # นาทีในการปรุง (ใช้ กระทะ)
T_FINISH = 1    # นาทีในการจัดจาน (ใช้ คน)

# --- 2. ค่าคงที่การจำลอง ---
TOTAL_ORDERS = 10 # จำนวนออเดอร์ทั้งหมดที่จำลอง

# --- 3. สถานการณ์ที่จะรัน ---
# (ตรงกับหัวข้อใน PDF)
SCENARIOS = {
    "1. (1 คน 1 กระทะ)": {'person_cap': 1, 'pan_cap': 1},
    "3. (1 คน 2 กระทะ)": {'person_cap': 1, 'pan_cap': 2}, # (แม่ครัวเท่าเดิม กระทะเพิ่ม)
    "2. (2 คน 2 กระทะ)": {'person_cap': 2, 'pan_cap': 2}  # (แม่ครัวเพิ่ม กระทะเพิ่ม)
}